app/controllers/devices_controller.rb

  def index
    @devices = Device.all
---
SELECT `devices`.* FROM `devices`

    def set_device
      @device = Device.find(params[:id])
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 1 LIMIT 1