app/controllers/esps_controller.rb

  def version
    @version = Esp.where(mac:params[:mac]).first.lastVersion?
---
SELECT  `esps`.* FROM `esps` WHERE `esps`.`mac` = 'AA:BB:CC:DD:EE:FF' ORDER BY `esps`.`id` ASC LIMIT 1

  def sendData
    @data = Esp.where(mac:params[:mac]).first.getLastVersion(params[:page].to_i,params[:size].to_i)
---
SELECT  `esps`.* FROM `esps` WHERE `esps`.`mac` = 'AA:BB:CC:DD:EE:FF' ORDER BY `esps`.`id` ASC LIMIT 1

  def updated
    Esp.where(mac:params[:mac]).first.updated
---
SELECT  `esps`.* FROM `esps` WHERE `esps`.`mac` = 'A0:20:A6:00:F3:CD' ORDER BY `esps`.`id` ASC LIMIT 1

    def set_esp
      @esp = Esp.find(params[:id])
---
SELECT  `esps`.* FROM `esps` WHERE `esps`.`id` = 0 LIMIT 1