app/controllers/targets_controller.rb

  def index
    @targets = Target.all
---
SELECT `targets`.* FROM `targets`